nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/lpi2c/edma_b2b_transfer/master/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MC56F81768
package_id: MC56F81768LVLH
mcu_data: ksdk2_0
processor_version: 0.14.12
board: MC56F81000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '37', peripheral: QSCI1, signal: TXD, pin_signal: GPIOC11/LP_SCLS0/LP_SCL1/TXD1/PWMA_0X}
  - {pin_num: '38', peripheral: QSCI1, signal: RXD, pin_signal: GPIOC12/LP_SDAS0/LP_SDA1/RXD1/PWMA_1X}
  - {pin_num: '55', peripheral: LPI2C0, signal: SDA, pin_signal: GPIOC14/LP_SDA0/XB_OUT4/PWMA_FAULT4, open_drain: enable, pull_enable: disable}
  - {pin_num: '56', peripheral: LPI2C0, signal: SCL, pin_signal: GPIOC15/LP_SCL0/XB_OUT5/PWMA_FAULT5, open_drain: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMode(BOARD_TXD1_GPIO, BOARD_TXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_TXD1);
    /* Enable peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMode(BOARD_RXD1_GPIO, BOARD_RXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_RXD1);
    /* Enable peripheral functionality on pin GPIOC14 (pin 55) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC14 (pin 55) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C14_LP_SDA0);
    /* Enable peripheral functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C15_LP_SCL0);

    /* Pin configuration on GPIOC14 (pin 55) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOC15 (pin 56) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Internal Peripheral Select */
    /* Select SCI1_RXD Input.: Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI1_RXDInputIndex, kSIM_SCI1_RXDInput_GPIOC12_GPIOF5);


    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_14_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_14_DISABLED));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
